loadtest/hello.yml
config:
  target: 'http://localhost:46491'
  phases:
    -
      duration: 300
      arrivalRate: 300
      name: "High load phase"

  environments:
    production:
      target: ""
    dev:
      target: "https://devssktsapi.azurewebsites.net"

  variables:
    performanceId:
      - "1182017011816140071850"
    refreshToken:
      - "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJncmFudF90eXBlIjoidXJuOmlldGY6cGFyYW1zOm9hdXRoOmdyYW50LXR5cGU6and0LWJlYXJlciIsImlhdCI6MTQ4NzkyOTExOH0.W-VfmRRdBxrNDvE-x8aVGOGOCvWz2Xbq7_-iToXaXUY"

  timeout: 60

scenarios:
  - flow:
    - post:
        url: "/oauth/token"
        json:
          assertion: "{{ refreshToken }}"
          scope: "admin"
        capture:
          json: "$.access_token"
          as: "accessToken"

    - get:
        url: "/performances/{{ performanceId }}"
        headers:
          Authorization: "Bearer {{ accessToken }}"